app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "read", "library", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "A Wizard of Earthsea"], ["author", "Ursula K Le Guin"], ["read", 0], ["library", 0], ["created_at", "2021-11-22 17:16:02.976605"], ["updated_at", "2021-11-22 17:16:02.976605"]]